var config = {
    /*在这里配置你的基本信息，所有数据以字符串形式给出*/
    name: "折松",
    sex: "男",
    age: "21",
    phone: "要不还是用邮件联系叭~",
    email: "Cx330_502@outlook.com",
    address: "北京海淀",
    qq: "1175963382",
    log: "Cx330-502",
    excpect_work: "Python后端开发",


    /*在这里配置首页的座右铭集合*/
    motto: [
        "明天不一定会更好，但要坚信更好的明天一定会来。",
        "要做的事情总找得出时间和机会，不愿意做的事情也总能找得出借口。",
        "Gor For It!",
        "有智者立长志，无志者长立志。",
        "那些过去的眼泪终将风干在记忆里。",
        "真相，是为了剿灭幻想。",
        "我欲将心向明月，奈何明月照沟渠。",
        "春风得意马蹄疾，一日看尽长安花。",
        "天凉好个秋！",
        "老骥伏枥，志在千里。烈士暮年，壮心不已。",
        "老当益壮，宁移白首之心。穷且益坚，不坠青云之志。",
        "我们必须拿我们所有的， 去换我们所没有的",
        "蒹葭苍苍，白露为霜；所谓伊人，在水一方。",
        "数风流人物，还看今朝！"
    ],


    /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
    welcome: "青青子衿，悠悠我心<br>" +
             "但为君故，沉吟至今<br>" +
             "你好，我是折松，北京航空航天大学软件工程大三在读生<br>" +
             "很高兴见到你!",


    /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
    about: "<p>你好！我叫折松，性别男，期望的岗位是Python后端开发。</p>" +
        "<p>我有大量Python Django后端开发经验，也有C++、Java小型项目、以及多个前端页面项目经验。" +
        "此外，我还使用Godot进行过个人独立游戏开发并自学过虚幻5引擎</p>" +
        "<p>计算机基础知识掌握扎实，能够在工作中很好的完成自己的任务。" +
        "此外，我有着充满激情的工作态度，团队协同作战能力强，同时也具备独立开发的能力，擅于发现并解决问题。" +
        "我的执行力强、责任感高、集体荣誉感强、敢于担当，能够接受加班或出差等安排</p>" +
        "<p>十分期待与您的联系!</p>",



    /** 
    * 在这里配置你的技能点
    * ["技能点", 掌握程度, "技能条颜色"]
    */  
    skills: [
        ["Python", 90, "red"],
        ["Java", 75, "blue"],
        ["C++", 83, "green"],
        ["SQL", 70, "#1abc9c"],
        ["HTML5", 67, "rgba(0,0,0)"],
        ["CSS3", 60, "yellow"],
        ["JavaScript", 70, "pink"],
        ["Vue", 60, "orange"]
    ],


    /*这里填写你的技能描述，你可以内嵌HTML标签以调整格式*/
    skills_description: "<ul>" +
        "     <li>操作系统、计算机网络等编程基础知识良好。</li>" +
        "     <li>熟练掌握Python基础及Django、Flask等框架。</li>" +
        "     <li>熟练掌握HTTP、WebSocket等网络协议。</li>" +
        "     <li>熟练掌握Java、C++、C等基础知识。</li>" +
        "     <li>熟悉HTML、CSS、JavaScript及Vue框架。</li>" +
        "     <li>熟悉SQL语句编写以及调优。</li>" +
        "     <li>熟悉基本Linux命令操作。</li>" +
        "     <li>熟悉缓存、消息等机制。</li>" +
        "     <li>了解分布式系统的设计与应用。</li>" +
        "     <li>熟悉Docker、K8s等容器技术。</li>" +
        "     <li>熟悉Godot游戏引擎及GDScript脚本语言。</li>" +
        "     <li>熟悉Git版本控制工具。</li>" +
        " </ul>",


    /**
     * 这里填写你的个人作品展示
     * ["img"，"url", "ProjectName", "brief"]
     * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
     * 通过查看实际效果以调整字题长度
     */
    portfolio: [
        ["./images/portfolio/home.png", "https://www.cx330-502.top/", "个人主页", ""],
        ["./images/portfolio/Ace.png", "https://magic-ace.cx330-502.top/", "社团主页", "这是我为社团制作的主页"],
        ["./images/portfolio/blog.png", "https://blog.cx330-502.top/", "个人博客", "记录了我的一些学习经历和Bug解决方案"],
        ["./images/portfolio/blackroom.png", "https://blackroom.cx330-502.top/", "小黑屋", "部署了一个文字小游戏<br>(不是我编写的)"],
        ["./images/portfolio/knGraph.png", "", "知识图谱自动构建", "独立完成大部分前端"],
        ["./images/portfolio/questionnaire.png", "https://github.com/Cx330-502/soul-qn-django", "问卷生成与分享工具", "负责Django后端"],
        ["./images/portfolio/AgileLink.png", "https://github.com/Cx330-502/AgileLink_Django_public", "软工团队协作与管理平台", "websocket技术实现多方面实时协同工作"],
        ["./images/portfolio/AgileScholar.png", "https://github.com/Cx330-502/Qingjin-Academic-Django1", "学术成果分享系统", "完成elasticsearch查询脚本及后端所有接口"],
        ["./images/portfolio/LLVM.png", "https://github.com/Cx330-502/llvm_compiler", "LLVM编译器设计", "C++完成了对C语言文法的子集完成从词法分析、语法分析、错误处理到目标代码生成等编译过程的编译器的实现，生成LLVM目标代码"],
    ],


    /**
     * 这里填写您的工作经历
     * ["日期"， "工作"， "介绍"]
     * 你可以内嵌HTML标签以排版格式
     */
    work: [
        //如果您内有工作经历，您可以采取下列写法
        // ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]

        // ["2020/7/1 — 2021/8/10", "<br>阎王殿实习生",
        //     "<p><strong>阎王殿研发部</strong></p>" +
        //     "<p>随着阴历7月15中元节的到来，阎王殿的任务愈发庞大，我以及我所在小组主要负责阎王谱后台部分，拟在解决千万访问并发问题，经过不械努力，使得产品稳定、高效的运行。</p>" +
        //     "<p>随着阴历7月15中元节的到来，阎王殿的任务愈发庞大，我以及我所在小组主要负责阎王谱后台部分，拟在解决千万访问并发问题，经过不械努力，使得产品稳定、高效的运行。</p>"
        // ],
        //
        // ["2020/7/1 — 2021/8/10", "<br>阎王殿实习生",
        //     "<p><strong>阎王殿研发部</strong></p>" +
        //     "<p>随着阴历7月15中元节的到来，阎王殿的任务愈发庞大，我以及我所在小组主要负责阎王谱后台部分，拟在解决千万访问并发问题，经过不械努力，使得产品稳定、高效的运行。</p>" +
        //     "<p>随着阴历7月15中元节的到来，阎王殿的任务愈发庞大，我以及我所在小组主要负责阎王谱后台部分，拟在解决千万访问并发问题，经过不械努力，使得产品稳定、高效的运行。</p>"
        // ]
        ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]
    ],


    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        ["2021-05-27", "十三届蓝桥杯北京赛区单片机设计与开发二等奖", "大一下学期，我参与第十二届蓝桥杯大学生A组，然比赛一改以往暴力题，半数以上DP，仅取得省级三等奖。"],
        ["2021-08-27", "五星社团北航Ace魔术社副社长", "大一下学期，我参与第十二届蓝桥杯大学生A组，然比赛一改以往暴力题，半数以上DP，仅取得省级三等奖。"],
        ["2023-08-17", "网易雷火游戏开发OPEN DAY一等奖", "大一下学期，我通过面向全年级的选拔，获得入队名额，在个人赛中获得全国三等奖。"],
        ["2023-12-11", "2023腾讯游戏客户端开发公开课", "大一下学期，我通过面向全年级的选拔，获得入队名额，在个人赛中获得全国三等奖。"],
    ],


    /**
     * 在这里填写您的社交网络平台
     * ["img", "url", "desc"]
     * img是社交平台的图标，在./svg目录下我们已经准备好了 微博、简书、掘金、小红书、知乎、csdn、facebook、github、力扣、CF和qq的图标
     * url是您链接
     * desc是一段描述，将鼠标移入将会显示该描述
     * 建议您放置数量 <= 5
     */
    icon: [
        ["./svg/LeetCode.svg", "https://leetcode-cn.com/u/happysnaker/", "我的力扣主页"],
        ["./svg/github.svg", "https://github.com/happysnaker", "我的GitHub主页"],
        ["./svg/博客.svg", "http://1.15.234.109:8000", "我的个人博客"],
        ["./svg/掘金.svg", "https://juejin.cn/user/3853167638625000", "我的掘金主页"],
        ["./svg/知乎.svg", "https://www.zhihu.com/people/tian-xia-you-dao-81", "我的知乎主页"]
    ],


    //这是一些图片链接，建议您仅更改第二个头像图片
    url: [
        //背景图、头像、作品展示背景、其他经历背景
        "./images/bg-index.jpg",
        "./images/avatar.jpg",
        "./images/bg-work.jpg",
        "./images/bg-others.jpg"
    ]

}
